# for문
# for 변수 in range(start,end ,step):
#     반복할 코드
# 위 형식이 반복문의 기본 형태이며, 중첩이 가능함

# range(start, end, step) 여기서 start, end, step은 정수(ex. range(1, 5, 2))
# start부터 end까지(end는 포함 안됨) step 만큼 증가/감소된 값을 변수에 넣고 반복
# start랑 step은  생략이 가능.
# start를 생략하면 0
# step을 생략하면 1
# range(5)        ==> start와 step 둘다 생략된 상태
# 태
# 위 세가지 모양만 있음
# for i in range(0,5,1): # i변수에 범위(0,1,2,3,4)를 넣으면서 반복 총 5번 반복
#     print(i)         
# range(0,5)      ==> step가 생략된 상태
# range(0 ,5, 1)  ==>완전한 상 # 반복할 코드에 변수 사용

# for i in range(0, 5, 1):
#     print('hello')     #반복할 코드에 변수 사용 x


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 1부터 100까지 홀수만을출력

# for i in range(1, 100, 2):
#     print(i)


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 5부터 100까지 5의배수를 출력

# for i in range(5, 105, 5):
#     print(i)


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 10000까지의 제곱수를 출력

# for i in range(1, 101, 1):
#     print(i*i)


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# while문
# while(조건식)
#         코드
# 위형식으로 사용
# if문과 비슷하게 조건식이 true일 경우 실행됨

# i = 0
# while(i<5):
#         print(i)
#         i += 1      i = i + i 이랑 같은 뜻, 누적 덧셈


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 1부터 100까지 짝수만을 출력
i = 2
# while(i<101):
#         print(i)
#         i += 2


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 1부터 100까지의 7의 배수를 출력
# i = 7
# while(i<101):
#         print(i)
#         i += 7


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 1부터 100까지 분수를 출력

# i = 1
# while(i<101):
#         print(1/i)
#         i = i+1



#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 무한반복
# python에서는
# while(true):
#         코드
# 위와 같이 while에 true를 넣어 무한 반복이 가능함


# continue 와 break
# continue 와 break는 for, while 둘다 사용가능
# continue
# continue를 만나는 순간 다음 반복 진행

# for i in range(0, 10, 1):
#     if(i%2 == 0):
#         continue        #짝수일 떄 다음 반복으로, 즉 짝수는 출력 안됨
#     print(i)


# break
# break를 만나는 순간 반복문 종료
# 보통의 경우 break는 if 랑 같이 사용

# i = 0
# while(True):
#     print(i)
#     if(i ==10):
#         break
#     i = 1


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# while(True):
#     print("메뉴를 선택해주세요")
#     print("1, hello 출력")
#     print("2, hi 출력")
#     print("3, exit")
#     menu = int(input())

#     if(menu == 1):
#         print("hello")
#     elif(menu == 2):
#         print("hi")
#     elif(menu == 3):
#         print("메뉴 프로그램을 종료 합니다")
#         break
#     else:
#         print("잘못 입력했습니다.1-3 숫자를 입력해주세요.")
#         print()
#         print()
#         continue

#     print()
#     print()


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# 중첩 반복문 
# 반복문 내부에 반복문이 있는 형식
# 반복문이 2번 중첩이면 이중첨 , 3번 중첩이면 3중첩 반복문이다. 실제로는 3중첩이상은 잘 사용 안함

# for x in range(1, 10, 1):       총 9번 반복
#     for y in range(1, 10, 1):   총 81번 반복
#         print(x, "*", y,"=", x*y)


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# range() 내부에 변수를 이용 가능
# for i in range(1, 10, 1) :
#     for j in range(1, i+1, 1) :     range() 내부에서 바깥 변수 사용
#         print(i,'*', j, '=',i*j)


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# for x in range(1, 20, 1):       
#     for y in range(1, 10, 1):   
#         print(x, "*", y,"=", x*y)


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# for x in range(1, 9, 1):       
#     for y in range(x, x+3, 1):   
#         print(y)


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# for x in range(1, 6, 1):      
#     print('A') 
#     for y in range(1, x+1, 1):   
#         print('B')
    

#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# [줄바꿈 무시]
# print()를 사용하게 되면 자동으로 줄을 바꾼다
# 이것을 무시하기 위해서는 print()안에 ,end=' '을 사용한다.
# 정확한 end='문자'의 뜻은 어떤 내용을 출력하고 뒤에 줄 바꿈을 하지 않은 후 문자를 추가이다. 보통 빈칸으로 많이 사용
# for i in range(0, 5, 1)
#     print('cit', end='')
# print()

# for i in range(0,5,1):
#     print('cit', end='@')
# print()


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# *
# * *
# * * *
# * * * *
# * * * * *

# for i in range(1, 6, 1):       
#     for y in range(1, i+1, 1):   
#         print('*',end=' ')
#     print()

#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# * * * * *
# * * * *
# * * *
# * *
# *

# for i in range(5, 0, -1):       
#     for y in range(1, i+1, 1):   
#         print('*',end=' ')
#     print()


#++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


#         *
#       * *
#     * * *
#   * * * *
# * * * * *

# for i in range(5, 0, -1):       
#     for y in range(1, i+1, 1):   
#         print(' ',end=' ')
#     for z in range(i, 6, 1):
#         print('*',end=' ')
#     print()


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


# * * * * *
#   * * * *
#     * * *
#       * *
#         *


# for i in range(1, 6, 1):       
#     for y in range(1, i+1, 1):   
#         print(' ',end=' ')
#     for z in range(i, 6, 1):
#         print('*',end=' ')
#     print()


#+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++#


#         *
#       * * *
#     * * * * *
#   * * * * * * *
# * * * * * * * * *


# for i in range(5, 0, -1):       
#     for y in range(1, i+1, 1):   
#         print(' ',end=' ')
#     for z in range(i, 6, 1):
#         print('*',end=' ')
#     for x in range(i, 5, 1):
#         print('*',end=' ')
#     print()


for i in range(1, 6, 1):
    for j in range(1, 6-i, 1):
        print(' ',end=' ')
    for j in range(0, 2*i-1, 1):
        print('* ', end='')
    print()